#include "map.h"
#include <QPainter>


Map::Map()
{

}


void Map::initialmap(){
    int map[16][27] =
    {
        0, 0, 4, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 6, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 6, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 6, 1, 1, 2, 6, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 1, 1, 6, 6, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 6, 1, 1, 2, 6, 0, 0, 0, 0, 0,
        2, 6, 1, 1, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 1, 1, 6, 6, 0, 0, 0, 0, 0,
        6, 6, 1, 1, 6, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 6, 1, 1, 2, 6, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 2, 6, 0, 0, 2, 6, 0, 0, 2, 6, 0, 0, 6, 6, 1, 1, 6, 6, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 6, 6, 0, 0, 6, 6, 0, 0, 6, 6, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 5, 6, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 6, 6, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    };
    int i,j;
    for(i=0;i<16;i++)
        for(j=0;j<27;j++)
            maparr[i][j]=map[i][j];
    grass.load(":/image/Grass.png");
    road.load(":/image/Road.png");
    towerarea.load(":/image/Towerarea.jpg");
    entrance.load(":/image/entrance.jpg");
    home.load(":/image/home.jpg");
    for ( j = 0; j < 16; j++)
        for ( i = 0; i < 27; i++){
            switch (maparr[j][i]){
            case 2:
                _towerarea.push_back(new Towerarea(i * 40, j * 40));
            }
        }
}

void Map::drawmap(QPainter *painter){
    for (int j = 0; j < 16; j++)
        for (int i = 0; i < 27; i++)
        {
            switch (maparr[j][i])
            {
            case 0:     /*草地*/
                painter->drawPixmap(i * 40, j * 40, 40, 40,grass);
                break;
            case 1:     /*地面*/
                painter->drawPixmap(i * 40, j * 40, 40, 40,road);
                break;
            case 2:     /*防御塔坑*/
                painter->drawPixmap(i * 40, j * 40, 80, 80,towerarea);


                //防御塔坑坐标初始化塔坑坐标，插入到塔坑对象数组

                break;
            case 4:
                painter->drawPixmap(i * 40, j * 40, 80, 80,entrance);
                break;

            case 5:
                painter->drawPixmap(i * 40, j * 40, 80, 80,home);
                break;
            }
        }
}
